Tekla Open API Reference for Tekla Structures 2025
BentPlateGeometrySolver.SetBendAngle Method
 Sets angle as the angle of curved section sectionToSetAngle and modifies geometry starting from sectionToMove.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectiveGeometry SetBendAngle(
	double angle,
	GeometrySection sectionToSetAngle,
	GeometrySection sectionToMove,
	ConnectiveGeometry geometry
)
Public Function SetBendAngle (
	angle As Double,
	sectionToSetAngle As GeometrySection,
	sectionToMove As GeometrySection,
	geometry As ConnectiveGeometry
) As ConnectiveGeometry
Parameters
angle
Type: System.Double
Angle in degrees to set.
sectionToSetAngle
Type: Tekla.Structures.Model.GeometrySection
Curved section to set angle value.
sectionToMove
Type: Tekla.Structures.Model.GeometrySection
Could be curved or plate section, used to know which side of chain to modify.
geometry
Type: Tekla.Structures.Model.ConnectiveGeometry
Geometry of the bent plate to modify.
Return Value
Type: ConnectiveGeometry
Returns modified geometry with on success or initial geometry on fail.
See Also
Reference
BentPlateGeometrySolver Class
Tekla.Structures.Model Namespace